export type Level = "bak" | "mn" | "mp" | "phd"
export type Specialty = "123" | "121" | "126"

const LEVEL_MAP: Record<string, Level[]> = {
    "Перший (бакалаврський)": ["bak"],
    "Другий (магістерський)": ["mn", "mp"],
    "Третій (доктор філософії)": ["phd"]
}

const SPECIALTIES_MAP: Record<Specialty, string> = {
    "121": "121 Інженерія програмного забезпечення",
    "123": "123 Комп’ютерна інженерія",
    "126": "126 Інформаційні системи та технології"
}

export const PROGRAMS_BY_SPECIALTY_AND_LEVEL: Record<Specialty, Record<Level, string[]>> = {
    "121": {
        phd: [
            "Інженерія програмного забезпечення"
        ],
        bak: [
            "Інженерія програмного забезпечення інформаційних систем",
            "Інженерія програмного забезпечення комп’ютерних систем"
        ],
        mn: [
            "Інженерія програмного забезпечення комп’ютерних та інформаційних систем"
        ],
        mp: [
            "Інженерія програмного забезпечення інформаційних систем",
            "Інженерія програмного забезпечення комп’ютерних систем"
        ]

    },

    "123": {
        phd: [
            "Комп’ютерна інженерія"
        ],
        bak: [
            "Комп’ютерні системи та мережі"
        ],
        mp: [
            "Комп’ютерні системи та мережі"
        ],
        mn: [
            "Комп’ютерні системи та мережі"
        ]
    },

    "126": {
        phd: [
            "Інформаційні системи та технології"
        ],
        bak: [
            "Інтегровані інформаційні системи",
            "Інформаційні управляючі системи та технології",
            "Інформаційне забезпечення робототехнічних систем"
        ],
        mn: [
            "Інформаційні управляючі системи та технології",
        ],
        mp: [
            "Інтегровані інформаційні системи",
            "Інформаційні управляючі системи та технології",
            "Інформаційне забезпечення робототехнічних систем"
        ]
    }
}

export function getAvailablePrograms(specialties: Specialty[], level: Level | ""): string[] {
    if (!level) return []
    const set = new Set<string>()
    for (const code of specialties) {
        const byLevel = PROGRAMS_BY_SPECIALTY_AND_LEVEL[code]?.[level]
        if (!byLevel) continue
        byLevel.forEach((p) => set.add(p))
    }
    return Array.from(set).sort((a, b) => a.localeCompare(b, "uk"))
}